Tekla.Structures.AnalysisInternal.DotAnalysisModel.analysisObject
The analysis object instance.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.constructionMethod
The construction method of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.filterName
The filter name of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.analysisMethod
The analysis method of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.analysisEngine
The analysis engine of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.useModelMerge
This indicates whether model merge is used.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.numberOfIterations
The number of iterations of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.includeImperfections
This indicates whether imperfections are to be included.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.relativeAccuracy
The relative accuracy of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.modelUpdateModificationIdentifier
The identifier of th emodel update modification.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.resultsModificationIdentifier
The identifier of the results modification.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.resultsTime
The time of the results.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.resultsFrozen
This indicates whether the results are frozen.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.physicalFrozen
This indicates whether the physical objects are frozen.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.bracingFilterName
The bracing filter name.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.secondaryFilterName
The secondary filter name.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.nodePositionTolerance
The node position tolerance of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.snapDistance
The snap distance of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.useTrueCurvedMembers
This indicates whether members are true curved.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.useTwinProfiles
This indicates whether twin profiles are used.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.memberAxislocation
The axis location of the members.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.memberEndReleaseMethodByJoint
This indicates whether the endreleases are set by joint.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.updateModel
This indicates whether analysis model is updated.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.ToStruct(Tekla.Structures.Analysis.AnalysisModel,System.Boolean)
DO NOT USE! For internal usage only!
P: P.
update: Indicates whether analysis model is updated.